app/views/posts/_post.json.jbuilder

json.body post.body
json.created_at post.created_at
json.updated_at post.updated_at
---
INSERT INTO "posts" ("user_id", "title", "body", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 980190967], ["title", "Test title"], ["body", "Test body"], ["image", "test.jpg"], ["created_at", "2026-09-29 23:16:49.342756"], ["updated_at", "2026-09-29 23:16:49.342756"]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Updated title"], ["updated_at", "2026-09-29 23:16:47.961327"], ["id", 298486374]]