app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC
---
  def index
    @posts = Post.all.order(:id)

INSERT INTO "posts" ("user_id", "title", "body", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 980190967], ["title", "Test title"], ["body", "Test body"], ["image", "test.jpg"], ["created_at", "2026-09-29 23:16:49.342756"], ["updated_at", "2026-09-29 23:16:49.342756"]]
---
  def create
    @post = Post.create(
      user_id: current_user.id,
      title: params[:title],
      body: params[:body],
      image: params[:image],
    )

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Updated title"], ["updated_at", "2026-09-29 23:16:47.961327"], ["id", 298486374]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.update(
      title: params[:title] || @post.title,
      body: params[:body] || @post.body,
      image: params[:image] || @post.image,
    )